# https://github.com/Homebrew/homebrew-bundle

# Default target location for casks
cask_args appdir: "/Applications", require_sha: true

# Password manager
cask "bitwarden"

# Desktop utilities
cask "lunar" # Software monitor control via DDC
cask "balenaetcher"
cask "gimp"
cask "inkscape"
cask "slack"
cask "discord"

# Productivity
cask "google-chrome"
cask "microsoft-office"
cask "microsoft-teams"

# Containers
cask "docker"

# Nerd font for terminals and dev tools
cask "font-fira-code-nerd-font"

# Terminal tools
cask "iterm2"
cask "warp"
brew "rcm" # Dotfile management
brew "starship" # Fancy prompt
brew "whalebrew"

# Dev tools
whalebrew "whalebrew/wget"
brew "git"
cask "git-credential-manager" # Supports Azure DevOps auth
cask "visual-studio-code"
