# https://github.com/Homebrew/homebrew-bundle

# For MS SQL tools, you need to accept the EULA
# HOMEBREW_ACCEPT_EULA=Y brew bundle

# Default target location for casks
cask_args appdir: "/Applications", require_sha: true

# System package tools
brew "mas" # Mac App Store CLI

# Desktop utilities
cask "lunar" # Software monitor control via DDC
cask "balenaetcher"
cask "gimp"
cask "inkscape"
cask "slack"
cask "discord"
cask "vlc"

# Command-line utilities
brew "imagemagick"

# Productivity
cask "google-chrome"
cask "zoom"
cask "google-earth-pro"
cask "claude"

# Containers
brew "docker-desktop"
brew "kubectl"

# Nerd font for terminals and dev tools
cask "font-fira-code-nerd-font"

# Languages
brew "node"
brew "golang"
brew "python"

# Terminal tools
cask "iterm2"
brew "rcm" # Dotfile management
brew "starship" # Fancy prompt
brew "grc" # Generic colorizer
brew "multitail"
brew "lsd" # ls with icons and colors
brew "bat" # cat with syntax highlighting
brew "fzf" # Fuzzy finder
brew "ripgrep" # Fast grep alternative
brew "zoxide" # Fast directory jumping

# Dev tools
brew "git"
brew "bash"
brew "jq"
brew "gpg"
brew "ansible"
cask "visual-studio-code"
cask "zed"
brew "terraform"
brew "uv"
brew "sqlite"
# mas "WakeOnCommand", id: 1484204619
